app/Controllers/Dashboard.php

SELECT *
FROM `user`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $userModel = new UserModel();
        $data['users'] = $userModel->paginate(10); // 10 data per halaman