app/Controllers/Keuangan.php

   public function laporan()
    {
        $model = new \App\Models\KeuanganModel();
        $userId = session()->get('user_id');

        $keyword = $this->request->getGet('keyword');
        $sort = $this->request->getGet('sort');

        $builder = $model->where('user_id', $userId);

        if ($keyword) {
            $builder->groupStart()
                ->like('kategori', $keyword)
                ->orLike('keterangan', $keyword)
                ->groupEnd();
        }

        // Sorting
        if ($sort == 'nominal_asc') {
            $builder->orderBy('nominal', 'ASC');
        } elseif ($sort == 'nominal_desc') {
            $builder->orderBy('nominal', 'DESC');
        } else {
            $builder->orderBy('tanggal', 'DESC');
        }

        $data['keuangan'] = $builder->findAll();
---
SELECT *
FROM `keuangan`
WHERE `user_id` = '10'
ORDER BY `tanggal` DESC

    public function dataGrafik()
    {
        $model = new \App\Models\KeuanganModel();
        $userId = session()->get('user_id');

        // Ambil data per bulan
        $result = $model
            ->select("MONTH(tanggal) as bulan,
                    SUM(CASE WHEN jenis = 'pemasukan' THEN nominal ELSE 0 END) as total_pemasukan,
                    SUM(CASE WHEN jenis = 'pengeluaran' THEN nominal ELSE 0 END) as total_pengeluaran")
            ->where('user_id', $userId)
            ->groupBy('MONTH(tanggal)')
            ->orderBy('bulan')
            ->findAll();
---
SELECT MONTH(tanggal) as bulan, SUM(CASE WHEN jenis = 'pemasukan' THEN nominal ELSE 0 END) as total_pemasukan, SUM(CASE WHEN jenis = 'pengeluaran' THEN nominal ELSE 0 END) as total_pengeluaran
FROM `keuangan`
WHERE `user_id` = '10'
GROUP BY MONTH(tanggal)
ORDER BY `bulan`