app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `email` = 'coba3@gmail.com'
 LIMIT 1
---
   public function authenticate()
{
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $userModel = new UserModel();
    $user = $userModel->where('email', $email)->first();