app/Controllers/Tanaman.php

    public function index()
    {
        $model = new TanamanModel();
        $data['tanaman'] = $model->where('user_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `tanaman`
WHERE `user_id` = '10'

    public function simpan()
    {
        $model = new TanamanModel();
        $model->save([
            'user_id' => session()->get('user_id'),
            'nama' => $this->request->getPost('nama'),
            'jenis' => $this->request->getPost('jenis'),
            'varietas' => $this->request->getPost('varietas'),
            'lokasi' => $this->request->getPost('lokasi'),
            'tanggal_tanam' => $this->request->getPost('tanggal_tanam'),
            'status' => $this->request->getPost('status'),
        ]);
---
INSERT INTO `tanaman` (`user_id`, `nama`, `jenis`, `varietas`, `lokasi`, `tanggal_tanam`, `status`, `created_at`, `updated_at`) VALUES ('10', 'mawar9', 'merah', 'cek', 'cek', '2025-06-26', 'rusak', '2025-06-25 08:05:44', '2025-06-25 08:05:44')

    public function edit($id)
    {
        $model = new TanamanModel();
        $data['tanaman'] = $model->find($id);
---
SELECT *
FROM `tanaman`
WHERE `tanaman`.`id` = '2'

    public function filter()
    {
        $model = new TanamanModel();
        $jenis = $this->request->getGet('jenis');
        $lokasi = $this->request->getGet('lokasi');
        $status = $this->request->getGet('status');

        $query = $model->where('user_id', session()->get('user_id'));
        if ($jenis) $query->like('jenis', $jenis);
        if ($lokasi) $query->like('lokasi', $lokasi);
        if ($status) $query->where('status', $status);

        $data['tanaman'] = $query->findAll();
---
SELECT *
FROM `tanaman`
WHERE `user_id` = '10'
AND `status` = 'tumbuh'