app/Views/layouts/header.php

SELECT *
FROM `user`
WHERE `user`.`id` = '10'
---

    if ($userId) {
        $userModel = new UserModel();
        $found = $userModel->find($userId);