app/Views/layouts/main.php

SELECT COUNT(*) AS `numrows`
FROM `tanaman`
WHERE `user_id` = '10'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `panen`
JOIN `tanaman` ON `tanaman`.`id` = `panen`.`tanaman_id`
WHERE `tanaman`.`user_id` = '10'
 LIMIT 1
SELECT MONTH(tanggal) AS bulan, SUM(jumlah) AS total
FROM `panen`
JOIN `tanaman` ON `tanaman`.`id` = `panen`.`tanaman_id`
WHERE `tanaman`.`user_id` = '10'
GROUP BY `bulan`
ORDER BY `bulan` ASC
---

// Tanaman
$tanamanModel = new TanamanModel();
$jumlahTanaman = $tanamanModel->where('user_id', $userId)->countAllResults();

// Panen Total
$panenModel = new PanenModel();
$jumlahPanen = $panenModel->join('tanaman', 'tanaman.id = panen.tanaman_id')
                          ->where('tanaman.user_id', $userId)
                          ->selectSum('jumlah')
                          ->first()['jumlah'] ?? 0;

// Panen per Bulan
$panenPerBulan = $panenModel->select("MONTH(tanggal) AS bulan, SUM(jumlah) AS total")
    ->join('tanaman', 'tanaman.id = panen.tanaman_id')
    ->where('tanaman.user_id', $userId)
    ->groupBy('bulan')
    ->orderBy('bulan', 'ASC')
    ->findAll();

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `user_id` = '10'
AND `jenis` = 'pemasukan'
 LIMIT 1
SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `user_id` = '10'
AND `jenis` = 'pengeluaran'
 LIMIT 1
---

// Keuangan
$keuanganModel = new KeuanganModel();
$totalPemasukan = $keuanganModel->where(['user_id' => $userId, 'jenis' => 'pemasukan'])->selectSum('nominal')->first()['nominal'] ?? 0;
$totalPengeluaran = $keuanganModel->where(['user_id' => $userId, 'jenis' => 'pengeluaran'])->selectSum('nominal')->first()['nominal'] ?? 0;